mahdi-benhassen/esp-zigbee-matter-ecosystem/end_node/sdkconfig.defaults
# Universal End Node - ESP32-H2 / ESP32-C6
# One firmware for ALL sensor types (select via menuconfig)

CONFIG_IDF_TARGET="esp32h2"

# Partition Table (4MB flash)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Zigbee as End Device (Sleepy)
CONFIG_ZB_ENABLED=y
CONFIG_ZB_RADIO_NATIVE=y
CONFIG_ZB_ZED=y
CONFIG_ZB_ED_ROLE=y

# IEEE 802.15.4 Radio
CONFIG_IEEE802154_ENABLED=y
CONFIG_IEEE802154_RX_BUFFER_NUM=4

# Power management for Sleepy End Device
CONFIG_PM_ENABLE=y
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# CPU at 48MHz for power saving
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_48=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Disable unused features to save memory
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
CONFIG_ESP_HTTP_CLIENT_ENABLE=n
CONFIG_ESP_HTTPS_SERVER_ENABLE=n

# I2C master driver
CONFIG_I2C_ENABLE_SLAVE_DRIVER=n

# GPIO
CONFIG_GPIO_RANGE_MAX=31

# NVS
CONFIG_NVS_ENCRYPTION=n

CONFIG_ZB_SDK_1xx=y
